{
  "posts": [
    {
      "id": "launch-yeah-app",
      "title": "Launch Yeah! app",
      "category": "Aplicaciones",
      "tags": [
        "yeah-app"
      ],
      "excerpt": "The day has finally arrived. I'm launching my first app.",
      "content": "<p>The day has finally arrived. I'm launching my first app. It's been an intense and incredibly fun journey, but not without effort and many hours of learning. But when you enjoy something, that's a light burden, a weight that fuels an unstoppable engine.</p><p>I'll try to be brief. The idea for Yeah! came to me spontaneously, a kind of strange inspiration where my mind combined the initials of \"Yeah!\" as an acronym for \"I was there\", in spanish: yo estuve ahí, and the exclamation mark 📍. The deeper truth is that I've been a Foursquare user for over a decade, and later a Swarm user, and in recent years I've lived with the fear that the app would shut down and I'd lose my data and my way of checking in, and therefore, my record of where I go and what I do over the years. During all this time of uncertainty, I unsuccessfully searched for an alternative solution with some of the features I wanted, such as syncing these check-ins with the calendar (Swarm doesn't actually do this, but it can be done through IFTTT or Zapier), that was secure, private, simple, and effective.</p><p>The best solutions are usually the ones you create yourself, so with that idea and that name, yeah!, I decided to make the app I'd always wanted, with everything I wanted and hoped a check-in app should do. That's how yeah! was born: simple, fast, and spontaneous. Now the path ahead is uncertain, but that's what makes it fun. I hope you love yeah! as much as I loved making and using it. Any positive feedback is welcome. Thank you all for your time and attention, from the bottom of my heart.</p><p>yeah¡-app</p><p><br></p><p>---------------------</p><p><br></p><p>Por fin ha llegado el día. Publico mi primera aplicación. Ha sido un camino intenso y muy muy divertido, pero no por ello sin esfuerzo y muchas horas de aprendizaje, pero cuando disfrutas algo, eso es un peso leve, un peso que alimenta un motor incombustible.</p><p>Intentaré ser breve. La idea de yeah¡ surgió al vuelo, una especie de inspiración extraña en la que mi cabeza unió las siglas de yeah como acrónimo de yo estuve ahí, y el símbolo de 📍 haciendo de exclamación.</p><p>La realidad más profunda es que llevo más de una década siendo usuario de Foursquare y más tarde Swarm, y en los últimos años he vivido con el miedo de que la app cerrase y perdiese mis datos y mi forma de hacer checkin y por tanto, de llevar un registro de a dónde voy y que hago a lo largo de los años.</p><p>Durante todos este tiempo de incertidumbre he buscado infructuosamente una solución alternativa con algunas de las opciones que quería, como sincronizar estos checkins con el calendario (en realidad esto no lo hace swarm, pero a través de IFTT o Zapier se puede hacer), que fuese segura, privada, sencilla y efectiva.</p><p><br></p><p>Las mejores soluciones suelen ser siempre las propias, así que decidí con esa idea y ese nombre, yeah¡ hacer la app que siempre había deseado con todo lo que quería y deseaba que hiciera un app de registro de lugares.</p><p>Ese es el nacimiento de yeah, sencillo, rápido y espontáneo.</p><p>Ahora el camino es incierto, pero eso es lo divertido.</p><p>Espero que améis yeah¡ tanto como yo haciéndola y usándola.</p><p>Cualquier reseña positiva será bien recibida. Gracias a todos por vuestro tiempo y atención, de corazón.</p><p>yeah¡-app</p><p><br></p>",
      "image": "https://i.ibb.co/N2svqJVY/Captura-de-pantalla-2025-11-23-a-las-9-49-32.png",
      "imagePosition": "bottom",
      "date": "2025-12-01",
      "updatedAt": "2025-12-01T18:52:28.802Z"
    },
    {
      "id": "1764441058361",
      "title": "Timeline of these 40 days",
      "category": "Aplicaciones",
      "tags": [
        "yeah-app"
      ],
      "excerpt": "Timeline of these 40 days",
      "content": "<ul><li>Let's try this out</li><li>I'm amazed, AI is the best teacher in the world</li><li>I like it, it's a challenge</li><li>This stuff is for me, difficult, satisfying, creative</li><li>&nbsp;Am I really going to be able to make a pretty cool webapp out of thin air?</li><li>&nbsp;I'm starting two more web app in parallel</li><li>Yes, I did it. Now let's try it on Android, which seems easier and is free.</li><li>What the hell is this Android Studio thing?</li><li>Come on, it's a challenge, calm down</li><li>Android is a fucking nightmare to develop for</li><li>I'm giving up on it, I'm focusing on the web app, period</li><li>What if I try it for iOS? I'd have to redo everything from scratch</li><li>Well, it's cool, I like it, it's convenient and pretty.</li><li>I love it.</li><li>What? I've already finished the first iOS app?</li><li>\"Your app is pending approval\"</li><li>Approved</li></ul><p><br></p><p><br></p><p><strong>My app launches on Monday, December 1st</strong></p><p><br></p><p><strong>Yeah! App - Stats:</strong></p><p>* Total lines of Swift code: ~10,004 lines</p><p>* Number of files: 35 files</p><p><strong>Breakdown:</strong></p><p>* Views (UI): ~4,500 lines</p><p>* Managers (Business Logic): ~2,500 lines</p><p>* Models (Data): ~800 lines</p><p>* Widgets &amp; Extensions: ~1,500 lines</p><p>* App Intents &amp; Shortcuts: ~700 lines</p>",
      "image": "https://i.ibb.co/VYgxCkNJ/Captura-de-pantalla-2025-11-25-a-las-11-45-53.png",
      "date": "2025-11-25",
      "updatedAt": "2025-11-30T08:17:28.115Z"
    }
  ],
  "lastUpdated": "2025-12-01T18:52:29.199Z",
  "version": "1.0"
}